Repository: nbargnesi/debian-snort
Catalog: debian/po/*.po
Languages: de, es, gl, it, ja, nl, ro, ru, sv

source: Your Snort configuration file (/etc/snort/snort.conf) uses deprecated options no longer available for this Snort release. Snort will not be able to start unless you provide a correct configuration file. You can substitute your configuration file with the one provided in this package or fix it manually by removing deprecated options.
de: Ihre Snort-Konfigurationsdatei (/etc/snort/snort.conf) nutzt veraltete Optionen, die ab dieser Version von Snort nicht mehr gültig sind. Snort kann solange nicht starten, bis Sie eine richtige Konfigurationsdatei erstellen. Sie können Ihre Konfigurationsdatei durch die des Pakets ersetzen oder durch entfernen der veralteten Optionen manuell berichtigen.
es: Su fichero de configuración de Snort (/etc/snort/snort.conf) utiliza opciones obsoletas que ya no están disponibles en esta versión de Snort. Snort no podrá arrancar a menos que tenga un fichero de configuración correcto. Puede sustituir este fichero de configuración por el que ofrece este paquete o arreglarlo manualmente eliminando las opciones obsoletas.
gl: O seu ficheiro de configuración de Snort (/etc/snort/snort.conf) emprega opcións obsoletas xa non dispoñibles nesta versión de Snort. Snort non ha poderse iniciar a menos que forneza un ficheiro de configuración correcto. Pode substituír o seu ficheiro de configuración co que se fornece neste paquete ou arranxalo manualmente eliminando as opcións obsoletas.
ja: Snort の設定ファイル (/etc/snort/snort.conf) にて、今回のリリースから使えなくなった無効なオプションを指定しています。設定ファイルを修正しない限り起動できなくなります。設定ファイルをこのパッケージが提供しているものに置換するか、無効なオプションを手動で削除するかして回避できます。
ru: Ваш файл настроек Snort (/etc/snort/snort.conf) использует устаревшие параметры, более не доступные в этом выпуске Snort. Snort не сможет запуститься, пока вы не предоставите корректный файл настроек. Вы можете подменить ваш файл настроек одним из поставляемых с этим пакетом или поправить его вручную, удалив устаревшие параметры.
sv: Din Snort-konfigurationsfil (/etc/snort/snort.conf) använder gamla inställningar som inte längre används i denna Snort-utgåva. Snort kan inte starta om du har felaktigheter i konfigurationsfilen. Du kan byta ut din konfigurationsfil med den som följer med detta paket eller lösa problemet manuellt genom att ta bort de felaktiga inställningarna.

source: The following deprecated options were found in your configuration file: ${DEP_CONFIG}
de: Folgende veraltete Optionen wurden in Ihrer Konfigurationsdatei gefunden: ${DEP_CONFIG}
es: Se encontraron las siguientes opciones obsoletas en el fichero de configuración: ${DEP_CONFIG}
gl: Atopáronse as seguintes opcións obsoletas no seu ficheiro de configuración: ${DEP_CONFIG}
ja: 設定ファイルで以下の無効なオプションが見つかりました: ${DEP_CONFIG}
ru: В вашем файле настроек были найдены следующие устаревшие опции: ${DEP_CONFIG}
sv: De följande inställningarna som hittades i din konfigurationsfil är inte längre giltiga: ${DEP_CONFIG}

source: Please enter the name(s) of the interface(s) which snort should listen on. The names of the available interfaces are provided by running 'ip link show'. This value usually is 'eth0', but you might want to vary this depending on your environment, if you are using a dialup connection 'ppp0' might be more appropiate.
es: Por favor, introduzca el nombre de la interfaz o interfaces en la que Snort debe escuchar. Puede obtener los nombres de las interfaces ejecutando «ip link show». Este valor suele ser «eth0», pero quizás desee variarlo dependiendo de su entorno. Si está utilizando una conexión telefónica a Internet basada en PPP puede ser más apropiado utilizar «ppp0».

source: Your system has an obsolete configuration file (/etc/snort/snort.common.parameters) which has been automatically converted into the new configuration file format (at /etc/default/snort). Please review the new configuration and remove the obsolete one. Until you do this, the init.d script will not use the new configuration and you will not take advantage of the benefits introduced in newer releases.
es: Su sistema tiene un fichero de configuración obsoleto (/etc/snor/snort.common.parameters) que ha sido convertido de forma automática al nuevo formato de fichero de configuración (en /etc/default/snort). Por favor, revise el nuevo fichero de configuración y borre el antigüo. El guión del init.d no utilizará la nueva configuración hasta que lo borre y no podrá aprovecharse de las ventajas introducidas en nuevas versiones.

source: On which interface should Snort listen?
es: ¿En qué interfaz debería escuchar Snort?
ja: Snort はどのインターフェイスで listen しますか?

source: Please enter the name(s) of the interface(s) which snort should listen on. The names of the available interfaces are provided by running 'ip link show'. This value usually is 'eth0', but you might want to vary this depending on your environment, if you are using a dialup connection 'ppp0' might be more appropiate.
es: Por favor, introduzca el nombre de la interfaz o interfaces en la que Snort debe escuchar. Puede obtener los nombres de las interfaces ejecutando «ip link show». Este valor suele ser «eth0», pero quizás desee variarlo dependiendo de su entorno. Si está utilizando una conexión telefónica a Internet basada en PPP puede ser más apropiado utilizar «ppp0».

source: Notice that Snort is usually configured to inspect all traffic coming from the Internet, so the interface you add here is usually the same the 'default route' is on. You can determine which interface is used for this running either 'ip route show' or '/sbin/route -n' (look for 'default' or '0.0.0.0').
es: Tenga en cuenta que generalmente se configura a Snort para que analice todo el tráfico que viene de Internet, así que la interfaz que se añade aquí es generalmente la misma que tiene definida la ruta por omisión. Para determinar qué interfaz se está utilizando para esto, ejecute bien «ip route show» o bien «/sbin/route -n» (busque aquellos valores asociados a «default» o «0.0.0.0»).
ja: 通常、Snort はインターネットからやって来るすべてのトラフィックを受け取るように設定されるので、ここで追加したインターフェイスは大抵 'default route' が存在するものと同じということに注意してください。'ip route show' または '/sbin/route -n' を実行し ('default' または '0.0.0.0' を探して)、どのインターフェイスを使うかを決めることができます。

source: Snort needs a configured database to log to.
es: Snort necesita tener una base de datos configurada a la que conectarse.
ja: Snort ではログを記録するのにデータベースの設定が必要です。

source: Please create the database structure now, using the following command: cd /usr/share/doc/snort-mysql/ zcat create_mysql.gz | mysql -u <user> -h <host> -p <databasename> Fill in the correct values for the user, host, and database names. MySQL will prompt you for the password.
es: Por favor, cree ahora la estructura de la base de datos utilizando la siguiente orden: cd /usr/share/doc/snort-mysql/ zcat create_mysql.gz | mysql -u <usuario> -h <servidor> -p <base_de_datos> Rellene correctamente los valores para el usuario, servidor y nombre de la base de datos. MySQL le solicitará la contraseña.
ja: ここで以下のコマンドを入力して、データベースを作成してください: cd /usr/share/doc/snort-mysql/ zcat create_mysql.gz | mysql -u <user> -h <host> -p <databasename> ユーザ名、ホスト名、データベース名は適当なものを当てはめて入力してください。 MySQL はパスワードを要求します。

source: After you created the database structure, press 'ok' to continue.
es: Después de haber creado la estructura de la base de datos, pulse «ok» para continuar.
ja: データベース作成後、'ok' を押して続行してください。

source: Should Snort disable promiscous mode on the interface?
es: ¿Debería Snort deshabilitar el modo promíscuo en la interfaz?
ja: このインターフェイスで promiscous モードを無効にしますか?

source: Please create the database structure now, using the following command: cd /usr/share/doc/snort-pgsql/ zcat create_pgsql.gz | psql -U <user> -h <host> -W <databasename> Fill in the correct values for the user, host, and database names. PostgreSQL will prompt you for the password.
es: Por favor, cree ahora la estructura de la base de datos utilizando la siguiente orden: cd /usr/share/doc/snort-pgsql/ zcat create_pgsql.gz | psql -U <usuario> -h <servidor> -W <base_de_datos> Rellene correctamente los valores para el usuario, servidor y nombre de la base de datos. PostgreSQL le solicitará la contraseña.
ja: ここで以下のコマンドを入力して、データベースを作成してください: cd /usr/share/doc/snort-pgsql/ zcat create_pgsql.gz | mysql -u <user> -h <host> -W <databasename> ユーザ名、ホスト名、データベース名は適当なものを当てはめて入力してください。 PostgreSQL はパスワードを要求します。

source: Please enter the interface name which snort should listen on. The name of the available interfaces are provided by running 'ip link show'. This value usually is 'eth0', but you might want to vary this depending on your environment, if you are using a dialup connection 'ppp0' might be more appropiate.
ja: Snort が listen すべきインターフェイス名を入力してください。指定可能なインターフェイスは 'ip link show' を実行すると確認できます。この値は大抵の場合 'eth0' ですが、これは環境にとても依存するので、ダイヤルアップ接続を利用している場合は 'ppp0' のほうがより適切かもしれません 。
