Repository: nbargnesi/debian-snort
Catalog: debian/po/*.po
Languages: de, es, gl, it, ja, nl, ro, ru, sv

source: boot
it: avvio
nl: opstarten
ro: la pornirea sistemului

source: dialup
nl: inbellen
ro: la conectarea „dialup”

source: manual
it: manuale
nl: manueel
ro: manuală

source: Snort start method:
it: metodo di avvio di Snort:
nl: Snort opstart methode:
ro: Metoda de pornire a lui Snort:

source: Snort can be started during boot, when connecting to the net with pppd or only manually with the /usr/sbin/snort command.
it: Snort può essere avviato durante l'avvio, durante la connessione alla rete con pppd, oppure solamente con il comando /usr/sbin/snort.
nl: Snort kan opgestart worden tijdens het opstarten van de computer, bij het openen van de netwerkverbinding door pppd of wanneer u het handmatig opstart.via /usr/bin/snort.
ro: Snort poate fi pornit fie la pornirea sistemului, fie la conectarea la internet cu pppd, fie manual via /usr/sbin/snort.

source: Interface(s) which Snort should listen on:
it: Interfaccia (o interfacce) su cui Snort dovrebbe essere in ascolto:
nl: Op welke interface(s) moet Snort luisteren?
ro: interfața/interfețele pe care să asculte Snort:

source: This value is usually 'eth0', but this may be inappropriate in some network environments; for a dialup connection 'ppp0' might be more appropiate (see the output of '/sbin/ifconfig').
it: Questo valore di solito è 'eth0', ma questo potrebbe essere inappropriato in alcuni ambienti di rete; per una connessione tramite modem, 'ppp0' potrebbe essere più appropriato (Suggerimento: usare il comando 'ip link show' di 'ifconfig').
nl: Deze waarde is normaal 'eth0', maar misschien wil u dit aanpassen afhankelijk van uw omgeving. Als u een inbelverbinding gebruikt, is 'ppp0' misschien meer geschikt (hint: gebruik 'ip link show' of 'ifconfig').
ro: Această valoare este de obicei „eth0”, însă această valoare ar putea fi nepotrivită în unele rețele; pentru conexiuni „dialup”, „ppp0” ar putea fi mai indicată (a se vedea informațiile afișate de „/sbin/ifconfig”).

source: Typically, this is the same interface as the 'default route' is on. You can determine which interface is used for this by running '/sbin/route -n' (look for '0.0.0.0').
it: Solitamente, questa è la stessa interfaccia stabilita quando è attivato 'default route'. Si può stabilire quale interfaccia usare per questa sessione con '/sbin/ip ro sh' o con '/sbin/route -n' (trova 'default' o '0.0.0.0').
nl: Deze interface is normaal dezelfde die de 'default route' heeft. Om te bepalen welke interface gebruikt wordt, kunt u '/sbin/route -n' uitvoeren(zoek naar '0.0.0.0').
ro: De obicei, aceasta este interfața pe care este definită ruta implicită. Puteți detecta care interfață este folosită în acest scop rulând „/sbin/route -n” (căutați „0.0.0.0”).

source: It is also not uncommon to use an interface with no IP address configured in promiscuous mode. For such cases, select the interface in this system that is physically connected to the network that should be inspected, enable promiscuous mode later on and make sure that the network traffic is sent to this interface (either connected to a 'port mirroring/spanning' port in a switch, to a hub or to a tap).
it: Non è anche insolito usare un'interfaccia senza IP e configurata in modo promiscuo; in tal caso, selezionare l'interfaccia del sistema che è fisicamente connessa alla rete da ispezionare, abilitare la modalità promiscua ed assicurarsi che il traffico di rete sia inviato verso questa interfaccia (oppure connesso ad una porta 'port mirroring/spanning' in uno switch, ad un hub o ad un tap)
nl: Het is ook niet ongewoon om Snort te draaien op een interface zonder IP adres en geconfigureerd in promiscue modus. In dat geval, selecteert u de interface die fysiek verbonden is met het netwerk dat u wilt onderzoeken, activeert u later de promiscue modus en verzekert u zich ervan dat het netwerkverkeer naar deze interface verzonden wordt (verbonden via een 'port mirroring/spanning'-poort op een switch, via een hub, of via een tap)
ro: De asemenea, nu este deloc neobișnuit a rula Snort pe o interfață fără adresă IP care este configurată în modul promiscuu. Dacă e cazul, selectați interfața care este conectată fizic la rețeaua care ar trebui inspectată, activați apoi modul promiscuu și asigurați-vă că traficul de rețea este trimis către acestă interfață (fie prin conectarea la un port de tip „oglindă” într-un switch, fie la un hub sau un interceptor).

source: You can configure multiple interfaces, just by adding more than one interface name separated by spaces. Each interface can have its own specific configuration.
it: Si possono configurare più interfacce, aggiungendo più di un nome di interfaccia separati da spazi. Ciascuna interfaccia può avere la sua specifica configurazione.
nl: U kunt hier verschillende interfaces definiëren, door meer dan één naam van een interface te vermelden, gescheiden door spaties. Elke interface kan zijn eigen specifieke configuratie hebben.
ro: Puteți configura mai multe interfețe prin simpla adăugare a mai mult de un singur nume de interfață, separatorul fiind spațiul. Fiecare interfață poate avea propria configurație specifică.

source: Address range for the local network:
it: Intervalli di indirizzi per la rete locale:
nl: Adresbereik waarop Snort zal luisteren?
ro: Intervalul de adrese pentru rețeaua locală:

source: Please use the CIDR form - for example, 192.168.1.0/24 for a block of 256 addresses or 192.168.1.42/32 for just one. Multiple values should be comma-separated (without spaces).
it: Usare un formato CIDR - per esempio 192.168.1.0/24 per un blocco di 256 indirizzi o 192.168.1.42/32 per uno solo. Più valori doverebbero essere separati da una virgola (senza spazi).
nl: U dient de CIDR-vorm te gebruiken (dit is 192.168.1.0/24 voor een blok van 256 IP-adressen of 192.168.1.42/32 voor één enkel IP-adres). U kunt meerdere adressen opgeven op één regel door ze te scheiden met kommas; spaties zijn hierbij niet toegestaan!
ro: Folosiți forma CIDR, de exemplu, 192.168.1.0/24 pentru un bloc de 256 de adrese IP sau 192.168.1.42/32 doar pentru o adresă. Valorile multiple trebuie separate cu (fără spații).

source: Please note that if Snort is configured to use multiple interfaces, it will use this value as the HOME_NET definition for all of them.
it: Notare che se Snort è configurato per usare più interfacce, essa userà questo valore come definizione HOME_NET per tutte le altre.
nl: Merk op dat als u meerdere interfaces gebruikt, deze definitie gebruikt zal worden als de HOME_NET definitie van al deze interfaces.
ro: A se reține că dacă Snort este configurat să folosească mai multe interfețe, va folosi această valoare ca definiția lui HOME_NET pentru toate.

source: Should Snort disable promiscuous mode on the interface?
de: Soll Snort den Modus »promiscuous« an der Schnittstelle ausschalten?
es: ¿Debería Snort deshabilitar el modo promíscuo en la interfaz?
gl: ¿Debería desactivar Snort o modo promíscuo na interface?
it: Snort deve disabilitare la modalità promiscua sull'interfaccia?
ja: Snort は、このインターフェイスで promiscous モードを無効にしますか?
nl: Wilt u dat Snort de promiscue modus van de interface uitschakelt?
ro: Se activează modul promiscuu pe interfață?
ru: Должен ли Snort запретить режим прослушивания на интерфейсе?
sv: Ska Snort inaktivera promiscuousläget på gränssnittet?

source: Disabling promiscuous mode means that Snort will only see packets addressed to the interface it is monitoring. Enabling it allows Snort to check every packet that passes the Ethernet segment even if it's a connection between two other computers.
it: Disabilitando la modalità promiscua significa che Snort vedrà solo i pacchetti indirizzati all'interfaccia che sta monitorando. Abilitandola, si permette a Snort di controllare ogni pacchetto che passa il segmento Ethernet anche se questa è una connessione fra altri due computer.
nl: Uitschakelen van de promiscue modus betekent dat Snort enkel die pakketten ziet die bestemd zijn voor zijn eigen interface. Het inschakelen van de promiscue modus laat Snort toe om elk op dit ethernet-segment langskomend pakket te controleren, zelfs als het een pakket is van een verbinding tussen twee andere computers.
ro: Dezactivarea modului promiscuu înseamnă că Snort va „vedea” doar pachetele adresate interfeței monitorizate. Activarea acestuia îi va permite lui Snort să verifice fiecare pachet care trece prin segmentul Ethernet, chiar dacă este o conexiune între alte două calculatoare.

source: Invalid interface
de: Ungültige Schnittstelle
gl: Interface non válida
it: Interfaccia non valida
nl: Ongeldige interface
ro: Interfața nu e validă
ru: Неправильный интерфейс
sv: Ogiltigt gränssnitt

source: Snort is trying to use an interface which does not exist or is down. Either it is defaulting inappropriately to 'eth0', or you specified one which is invalid.
it: Snort sta cercando di usare un'interfaccia che non esiste o che è spenta. O è stata configurata non correttamente come 'eth0', o è stato specificato uno che non è valido.
nl: Snort probeert een interface te gebruiken die niet bestaat of die niet actief is. Ofwel gebruikt Snort onterecht de standaard interface 'eth0', or heb je een interface opgegeven die niet correct is.
ro: Snort încearcă să folosească o interfață care nu există sau care nu este „ridicată”. Fie recurge în mod implicit și greșit la „eth0”, fie ați precizat o interfață care nu este validă.

source: Should Snort's testing order be changed to Pass|Alert|Log?
it: Cambiare l'ordine delle regole di test di Snort in Pass|Alert|Log?
nl: Moet de volgorde van het testen van de regels van Snort aangepast worden naar Pass|Alert|Log (doorlaten|alarmeren|loggen)?
ro: Se schimbă ordinea testelor lui Snort în Trece|Alertă|Jurnal?

source: Snort's default testing order is Alert|Pass|Log; if you accept this option, the order will be changed to Pass|Alert|Log, which can make it simpler to use Snort with some packet-filtering tools.
it: L'ordine di testing default di Snort è Alert|Pass|Log; se si accetta questa opzione, l'ordine verrà cambiato in Pass|Alert|Log, che può rendere più semplice usare Snort con alcuni strumenti packet-filtering.
nl: De standaard test volgorde van Snort is Alert|Pass|Log (Verwittigen|Doorlaten|Loggen); als je deze optie accepteert, zal de volgorde gewijzigd worden in Pass|Alert|Log (Doorlaten|Verwittigen|Loggen)' dit kan het eenvoudiger maken om Snort te gebruiken met sommige pakket filtering programma's.
ro: Ordinea implicită de testare a lui Snort este Alertă|Trece|Jurnal; dacă acceptați această opțiune, ordinea se va schimba în Trece|Alertă|Jurnal, lucru care poate face mai facilă utilizarea lui Snort cu anumite unelte de filtrare a pachetelor.

source: Should daily summaries be sent by e-mail?
de: Soll eine tägliche Statistik per E-Mail verschickt werden?
gl: ¿Débense enviar os resumos diarios por email?
it: Trasmettere via e-mail i riepiloghi giornalieri?
nl: Moeten de dagelijkse samenvattingen per e-mail worden verstuurd ?
ro: Doriți mesaje electronice zilnice cu sumarul?
ru: Отправлять ежедневные отчеты по e-mail?
sv: Ska dagliga sammandrag skickas via e-post?

source: A cron job can be set up to send daily summaries of Snort logs to a selected e-mail address.
it: Un lavoro cron può essere impostato per inviare giornalmente riepiloghi dei log di Snort ad un indirizzo e-mail selezionato.
nl: Een cron job kan opgezet worden om dagelijks samenvattingen van Snort logs naar een bepaald e-mail adres te sturen.
ro: Se poate configura un serviciu cron care să trimită zilnic la o anumită adresă de poștă electronică sumare ale jurnalelor lui Snort.

source: Please choose whether you want to activate this feature.
it: Scegliere se si desidera attivare questa funzione.
nl: Gelieve te kiezen als u deze optie wil activeren.
ro: Alegeți dacă doriți să activați această facilitate.

source: Recipient of daily statistics mails:
it: Destinazione delle mail statistiche quotidiane:
nl: Ontvanger van de dagelijkse statistiekmails:
ro: Destinatarul mesajelor zilnice cu statistici:

source: Please specify the e-mail address that should receive daily summaries of Snort logs.
it: Specificare l'indirizzo e-mail sul quale ricevere i riepiloghi giornalieri dei log di Snort.
nl: Gelieve het e-mail adres op te geven dat de dagelijkse samenvatting van de Snort logs moet ontvangen.
ro: Precizați adresa de poștă electronică unde se vor recepționa sumarele zilnice ale jurnalelor Snort.

source: Additional custom options:
it: Opzioni personalizzate aggiuntive:
nl: Extra eigen opties:
ro: Opțiuni adiționale particularizate:

source: Please specify any additional options Snort should use.
it: Specificare ogni altra eventuale opzione che Snort dovrebbe usare.
nl: Gelieve eventuele additionele opties te geven die Snort moet gebruiken
ro: Precizați orice alte opțiuni pe care să le folosească Snort.

source: Minimum occurrences before alerts are reported:
it: Numero minimo necessario prima che gli alert siano rapportati:
nl: Minimum aantal keren voorkomen om alarmen te rapporteren:
ro: Numărul minim de apariții pentru raportarea unei alerte:

source: Please enter the minimum number of alert occurrences before a given alert is included in the daily statistics.
it: Inserire il numero minimo di alert che necessitano prima che sia incluso nelle statistiche giornaliere.
nl: Een waarschuwing dient vaker dan het hier opgegeven aantal keren voor te komen opdat die weergegeven zou worden in de dagelijkse statistieken.
ro: Introduceți numărul minim de apariții ale unei anumite alerte necesar pentru a fi inclusă în statisticile zilnice.

source: You are running Snort manually
ro: Rulați Snort manual

source: Snort restart required
it: Riavvio di Snort necessario
nl: Een herstart van Snort is vereist
ro: Este necesară repornirea lui Snort

source: As Snort is manually launched, you need to run '/etc/init.d/snort' for the changes to take place.
it: Appena Snort è lanciato manualmente, è necessario lanciare '/etc/init.d/snort' per attivare i cambiamenti.
nl: Vermits Snort normaal manueel wordt gestart, moet u '/etc/init.d/snort' uitvoeren om de aanpassingen door te voeren.
ro: Deoarece Snort este pornit manual, trebuie să rulați „/etc/init.d/snort” pentru ca schimbările să fie luate în considerare.

source: There is an error in your configuration
de: Fehler in Ihren Einstellungen
es: Su configuración tiene un error
gl: Hai un erro na súa configuración
ja: 設定にエラーがあります
ro: Există o eroare în configurația dumneavoastră
ru: Ошибка в настройках
sv: Det finns ett fel i din konfiguration

source: Configuration error
it: Errore di configurazione
nl: Configuratiefout
ro: Eroare de configurare

source: The current Snort configuration is invalid and will prevent Snort starting up normally. Please review and correct it.
it: La corrente configurazione di Snort non è valida ed impedirà a Snort di avviarsi normalmente. Prego, rivederla e correggerla.
nl: De huidige Snort configuratie is ongeldig en zal verhinderen dat Snort normaal wordt opgestart. Gelieve de configuratie na te kijken en te corrigeren.
ro: Actuala configurație Snort nu este validă și îl va împiedica pe acesta să pornească normal. Revizuiți-o și corectați-o.

source: To diagnose an error in a Snort configuration file, use '/usr/sbin/snort -T -c <file>'.
it: Per diagnosticare un errore in un file di configurazione di Snort, usare '/usr/sbin/snort -T -c <file>'.
nl: Om een fout in een Snort congifuratiebestand te analyseren, gebruik '/usr/sbin/snort -T -c <file>'
ro: Pentru diagnosticarea unui fișier de configurare a lui Snort, folosiți „/usr/sbin/snort -T -c <fișier>”.

source: Obsolete configuration file
it: File di configurazione obsoleto
nl: Verouderd configuratie bestand
ro: Fișier de configurare depășit

source: This system uses an obsolete configuration file (/etc/snort/snort.common.parameters) which has been automatically converted into the new configuration file format (at /etc/default/snort).
it: Questo sistema usa un file di configurazione obsoleto (/etc/snort/snort.common.parameters) che è stato automaticamente convertito nel nuovo formato del file di configurazione (/etc/default/snort).
nl: Uw systeem heeft een verouderd configuratiebestand (/etc/snort/snort.common.parameters) dat nu automatisch is omgezet in een nieuw configuratiebestandsformaat (in /etc/default/snort).
ro: Acest sistem folosește un fișier de configurare învechit (/etc/snort/snort.common.parameters) care a fost convertit automat la noul format de fișier (/etc/default/snort).

source: Please review the new configuration and remove the obsolete one. Until you do this, the initialization script will not use the new configuration and you will not take advantage of the benefits introduced in newer releases.
it: Rivedere la nuova configurazione e rimuovere quella obsoleta. Nel frattempo, lo script di inizializzazione non utilizzerà la nuova configurazione e non si trarrà vantaggio dei benefici introdotti nelle nuove versioni.
nl: Kijkt u aub het nieuwe configuratiebestand na en verwijder het verouderde bestand. Tot u dit doet, zal het init.d script de nieuwe configratie niet gebruiken en zal u niet kunnen genieten van de voordelen die de nieuwere versies bieden.
ro: Verificați noul fișier de configurare și ștergeți-l pe cel vechi. Până atunci, scriptul init.d nu va folosi configurația nouă și nu veți profita de beneficiile introduse în versiunile mai noi.

source: Set up a database for snort-mysql to log to?
it: Impostare un database per i log di snort-mysql?
nl: Wilt u een een database opzetten waar snort-mysql het logboek in kan bijhouden?
ro: Se pregătește o bază de date în care snort-mysql va face jurnalizarea?

source: No database has been set up for Snort to log to. Before continuing, you should make sure you have:
it: Nessun database è stato configurato per il log di Snort. Prima di continuare, ci si dovrebbe assicurare di avere:
nl: Er is geen databank opgezet voor Snort om naar te loggen. Voor u verder kan gaan, moet u deze eerst opzetten:
ro: Nu s-a pregătit nici o bază de date în care Snort să țină jurnalele. Înainte de a continua, ar trebui să vă asigurați că aveți:

source: - the server host name (that server must allow TCP connections from this machine); - a database on that server; - a username and password to access the database.
it: - l'host name del server (quel server che deve autorizzare TCP connections da questa macchina); - un database su quel server; - un username e password per accedere al database.
nl: - de server host naam (die server met TCP verbindingen van deze machine accepteren) - een database op die server - een gebruikersnaam en paswoord om toegang te krijgen tot de databank
ro: - numele serverului (acel server trebuie să permită conexiuni TCP inițiate de pe acest sistem); - o bază de date pe acel server; - un nume de utilizator și o parolă pentru a accesa baza de date.

source: If some of these requirements are missing, reject this option and run with regular file logging support.
it: Se qualcuno di questi elementi richiesti manca, rifiutare questa opzione ed avviare con il supporto di un regolare file di logging.
nl: Als sommige van deze noodzakelijke elementen ontbreken, gebruik dan deze optie niet en draai Snort met gewone logging naar een bestand
ro: Dacă unele dintre aceste cerințe nu sunt satisfăcute, refuzați această opțiune și rulați cu jurnalizare în fișiere obișnuite.

source: Database logging can be reconfigured later by running 'dpkg-reconfigure -plow snort-mysql'.
it: Il database dei log può essere riconfigurato successivamente lanciando 'dpkg-reconfigure -plow snort-mysql'.
nl: Logging naar een databank kan later ook nog geconfigureerd worden met het commando 'dpkg-reconfigure -plow snort-mysql'
ro: Jurnalizarea într-o bază de date poate fi reconfigurată mai târziu, cu comanda „dpkg-reconfigure -plow snort-mysql”.

source: Database server hostname:
it: Hostname del server database:
nl: Database server hostnaam:
ro: Numele serverului cu baza de date:

source: Please specify the host name of a database server that allows incoming connections from this host.
it: Specificare il nome host di un database server che permetta connessioni in entrata da questo host!
nl: Gelieve een hostnaam voor de databank server op te geven. U dient ervoorte zorgen dat deze correct is ingesteld is om inkomende verbindingen vandeze computer te aanvaarden!
ro: Precizați numele unui server de baze de date care permite primirea de conexiuni de pe acest calculator.

source: Database name:
it: Nome del database:
nl: Databanknaam:
ro: Numele bazei de date:

source: Please specify the name of an existing database to which the database user has write access.
it: Specificare il nome di un database esistente su cui l'utente del database gode del permesso di scrittura.
nl: Gelieve de naam van een bestaande databank op te geven waarnaar de databank gebruiker schrijftoegang heeft
ro: Precizați numele unei baze de date deja existente la care utilizatorul de baze de date are drept de scriere.

source: Username for database access:
it: Nome utente per l'accesso al database:
nl: gebruikersnaam (account) voor database toegang:
ro: Numele de utilizator pentru accesul la baza de date:

source: Please specify a database server username with write access to the database.
it: Specificare un username per il database server con permesso di scrittura su questo database.
nl: Gelieve een databank gebruikersnaam op te geven met schrijfrechten in de databank:
ro: Precizați un utilizator de baze de date care are drept de scriere în baza de date.

source: Password for the database connection:
it: Password per la connessione al database:
nl: Gelieve het paswoord voor de databaseverbinding in te geven:
ro: Parola pentru conectarea la baza de date:

source: Please enter the password to use to connect to the Snort Alert database.
it: Inserire una password da usare per connettersi al database degli Alert di Snort.
nl: Wat is het wachtwoord om verbinding te maken met de Snort-Alert databank?
ro: Introduceți parola folosită pentru conectarea la baza de date pentru alertele Snort.

source: Configured database mandatory for Snort
it: Database configurato obbligatorio per Snort
nl: Een geconfigureerde databank is noodzakelijk voor Snort
ro: Este obligatorie o bază de date configurată pentru Snort

source: Snort needs a configured database before it can successfully start up. In order to create the structure you need to run the following commands AFTER the package is installed:
it: Snort necessita di un database configurato prima che possa partire con successo. Al fine di creare la struttura, è necessario lanciare il seguente comando DOPO che il pacchetto sia installato:
nl: Snort heeft een geconfigureerde database nodig voor het succesvol kan opstarten. Om de structuur aan te maken, moet u volgende commando's uitvoeren NADAT het pakket is geinstalleerd:
ro: Snort are nevoie de o bază de date configurată anterior pentru a putea porni. Pentru a crea structura, trebuie să rulați următoarele comenzi DUPĂ ce pachetul este instalat:

source: cd /usr/share/doc/snort-mysql/ zcat create_mysql.gz | mysql -u <user> -h <host> -p <databasename>
ro: cd /usr/share/doc/snort-mysql/ zcat create_mysql.gz | mysql -u <utilizator> -h <numeserver> -p <numelebazeidedate>

source: Fill in the correct values for the user, host, and database names. MySQL will prompt you for the password.
it: Riempire con i valori corretti dei nomi per utente, host e database. MySQL chiederà la password.
nl: Vul de correcte waarden in voor gebruiker, host en databank namen. MySQL zal u vragen naar het paswoord.
ro: Introduceți valorile corecte pentru utilizator, numele serverului și numele bazei de date. MySQL vă va cere interactiv parola.
