Repository: nbargnesi/debian-snort
Catalog: debian/po/*.po
Languages: de, es, gl, it, ja, nl, ro, ru, sv

source: Please restart Snort using: /etc/init.d/snort start to let the settings take effect.
de: Bitte starten Sie Snort neu mittels: /etc/init.d/snort start damit die Einstellungen wirksam werden.
es: Por favor reinicie a Snort con: /etc/init.d/snort start para que los cambios tengan efecto.
gl: Reinicie Snort empregando: /etc/init.d/snort start para que a configuración tome efecto.
ja: 設定変更を反映するために /etc/init.d/snort restart として Snort を再起動してください。
ru: Перезапустите Snort командой: /etc/init.d/snort start чтобы настройки вступили в силу.
sv: Vänligen starta om Snort med: /etc/init.d/snort start för att ändringarna ska aktiveras.

source: Your Snort configuration is not correct and Snort will not be able to start up normally. Please review your configuration and fix it. If you do not do this, Snort package upgrades will probably break. To check which error is being generated run '/usr/sbin/snort -T -c /etc/snort/snort.conf' (or point to an alternate configuration file if you are using different files for different interfaces)
de: Ihre Einstellungen von Snort sind nicht richtig und Snort wird nicht normal starten können. Bitte berichtigen Sie das. Wenn Sie das nicht beheben, werden Paketaktualisierungen von Snort wahrscheinlich abbrechen. Um den Fehler zu überprüfen, starten Sie '/usr/sbin/snort -T -c /etc/snort/snort.conf' (oder geben eine andere Konfigurationsdatei an, wenn Sie verschiedene Dateien für verschiedene Schnittstellen benutzen).
es: Su configuración de Snort no es correcta y no se podrá arrancar éste con normalidad. Por favor, revise su configuración y arreglela. Las actualizaciones del paquete Snort fallarán si no lo hace. Para comprobar el error que se genera ejecute «/usr/sbin/snort -T -c /etc/snort/snort.conf» (o utilice otro fichero de configuración si utiliza ficheros distintos para distintas interfaces)
gl: A súa configuración de Snort non é correcta e Snort non ha poderse iniciar de xeito normal. Revise a súa configuración e arránxea. Se non o fai, as actualizacións do paquete Snort han fallar. Para ver o erro que se xera, execute "/usr/sbin/snort -T -c /etc/snort/snort.conf" (ou apunte a un ficheiro de configuración alternativo se emprega ficheiros diferentes para interfaces diferentes).
ja: Snort の設定が正しくないので、そのままだと Snort が起動できなくなります。設定を見直して修正してください。行わない場合は Snort パッケージのアップグレードができなくなるでしょう。どこでエラーが起こっているのかをチェックするには '/usr/sbin/snort -T -c /etc/snort/snort.conf' を実行してください (異なったインターフェイスごとに別のファイルを使っているという場合は、他の設定ファイルを指定してください)。
ru: Ваши настройки Snort некорректны и Snort не сможет нормально запуститься. Пересмотрите ваши настройки и исправьте их. Если этого не сделать, обновления пакета Snort скорее всего обломятся. Чтобы проверить, какая ошибка генерируется, запустите '/usr/sbin/snort -T -c /etc/snort/snort.conf' (или укажите альтернативный файл настроек если используете разные файлы для разных интерфейсов)
sv: Din Snort-konfiguration är inte korrekt och Snort kommer inte att starta upp normalt. Vänligen kontrollera din konfiguration och lös problemen. Om du inte gör något åt detta kommer antagligen uppgraderingar av Snort-paket att misslyckas. Kontrollera vad som är fel göra du genom att köra "/usr/sbin/snort -T -c /etc/snort/snort.conf" (eller peka på en alternativ konfigurationsfil om du använder olika filer för olika gränssnitt).

source: This system uses an obsolete configuration file
de: Das System benutzt eine veraltete Konfigurationsdatei.
es: Este sistema utiliza un fichero de configuración obsoleto
gl: Este sistema emprega un ficheiro de configuración obsoleto
ru: Эта система использует устаревший файл настроек
sv: Detta system använder en gammal konfigurationsfil

source: Your system has an obsolete configuration file (/etc/snort/snort.common.parameters) which has been automatically converted into the new configuration file format (at /etc/default/snort). Please review the new configuration and remove the obsolete one. Until you do this, the init.d script will not use the new configuration and you will not take advantage of the benefits introduced in newer releases.
de: Ihr System hat eine veraltete Konfigurationsdatei (/etc/snort/snort.common.parameters), die automatisch in das neue Format (nach /etc/default/snort) umgewandelt wurde. Bitte überprüfen Sie die neue Konfigurationsdatei und löschen Sie die veraltete. Bis dahin wird das Startskript (in /etc/init.d) die neuen Einstellungen nicht verwenden und Sie können die Vorteile der neuen Version nicht nutzen.
gl: O seu sistema ten un ficheiro de configuración obsoleto (/etc/snort/snort.common.parameters) que se convertiu automáticamente ao novo formato de ficheiros de configuración (en /etc/default/snort). Revise a nova configuración e elimine a obsoleta. Ata que o faga, o script de init.d non ha empregar a nova configuración e non ha poder aproveitar as avantaxes das novas versións.
ru: В вашей системе был устаревший файл настроек (/etc/snort/snort.common.parameters), он был автоматически преобразован в файл нового формата (в /etc/default/snort). Просмотрите новые настройки и удалите устаревшие. Пока вы этого не сделаете, сценарий init.d не будет использовать новые настройки и вы не получите преимуществ, появившихся в новых выпусках.
sv: Ditt system har en gammal konfigurationsfil (/etc/snort/snort.common.parameters) vilken har blivit automatiskt konverterad till en ny konfigurationsfil med nytt format (i /etc/default/snort). Kontrollera den nya konfiguration och ta bort den gamla. Fram till att du gör detta kommer init.d-skriptet inte använda den nya konfigurationen och du kan inte använda de nya fördelarna i den nya versionen.

source: Do you want to set up a database for snort-mysql to log to?
de: Wollen Sie für snort-mysql eine Datenbank einrichten, in die es protokolliert?
es: ¿Quiere configurar una base de datos a la que snort-mysql enviará los registros?
gl: ¿Quere configurar unha base de datos para os rexistros de snort-mysql?
ja: snort-mysql を利用してログに記録するため、データベースを設定しますか?
ru: Установить базу данных для журналирования с помощью snort-mysql?
sv: Vill du konfigurera en databas för snort-mysql att logga in på?

source: You only need to do this the first time you install snort-mysql. Before you go on, make sure you have (1) the hostname of a machine running a mysql server set up to allow tcp connections from this host, (2) a database on that server, (3) a username and password to access the database. If you don't have _all_ of these, either select 'no' and run with regular file logging support, or fix this first. You can always configure database logging later, by reconfiguring the snort-mysql package with 'dpkg-reconfigure -plow snort-mysql'
de: Das ist nur bei der ersten Installation von snort-mysql nötig. Bevor Sie weiter machen, stellen Sie sicher, dass Sie (1) den Namen des Rechners kennen, auf dem ein MySQL-Server läuft und der TCP-Verbindungen von Ihrem Rechner annimmt, dass (2) es eine Datenbank auf diesem Server gibt und dass (3) Sie einen Datenbank-Benutzernamen mit Passwort kennen. Wenn Sie nicht _alle_ dieser Angaben haben, besorgen Sie sich diese zuerst oder lehnen hier ab und arbeiten mit Protokollierung in eine normale Datei. Sie können das Protokollieren in eine Datenbank später einschalten, indem Sie das Paket snort-mysql mit dem Kommando 'dpkg-reconfigure -plow snort-mysql' neu einrichten.
es: Sólo tiene que hacer ésto la primera vez que instale snort-mysql. Andes de seguir adelante asegúrese de que (1) el nombre de servidor del equipo que ejecuta la base de datos mysql permite realizar conexiones tcp desde éste equipo, (2) hay una base de datos en ese servidor, (3) el nombre de usuario y contraseña de acceso a la base de datos. Si no tiene _todos_ estos, escoja «no» y continúe con la configuración habitual de registro, o arregle esto. Siempre puede configurar la base de datos más adelante reconfigurando snort-mysql utilizando: «dpkg-reconfigure -plow snort-mysql»
gl: Só ten que o facer a primeira vez que instale snort-mysql. Antes de continuar, asegúrese de ter (1) o nome dunha máquina que execute un servidor mysql configurado para aceptar conexións tcp desta máquina, (2) unha base de datos nese servidor, (3) un nome de usuario e contrasinal para acceder á base de datos. Se non ten _todo_ iso, escolla "non" e execute Snort co soporte normal de rexistro en ficheiros ou arranxe a situación antes de nada. Sempre pode configurar despois o rexistro en bases de datos, reconfigurando o paquete snort-mysql con "dpkg-reconfigure -plow snort-mysql".
ja: 初めて snort-mysql をインストールした時のみ、この設定を行う必要があります。続行の前に、(1) このホストからの TCP 接続が許可されている mysql サーバのホスト名、(2) そのサーバでのデータベース名、(3) データベースにアクセスするためのユーザ名とパスワード を確認してください。これらが「すべて」そろっていない場合、 'no' を選択して通常のファイルへのログ記録を行うか、まず条件を確認してください。のちほど 'dpkg-reconfigure -plow snort-mysql' として snort-mysql パッケージを再設定して、データベースでのログ記録設定の変更がいつでも可能です。
ru: Вы должны сделать это при первой установке snort-mysql. Прежде чем продолжить, убедитесь, что у вас есть (1) имя машины с работающим сервером mysql, настроенным на прием tcp соединений с этого компьютера, (2) база данных на этом сервере, (3) имя пользователя и пароль для доступа к базе. Если у вас нет _всего_ этого, то либо выберите 'no' и работайте с поддержкой журналов в обычном файле, либо исправьте ситуацию. Вы всегда можете настроить журналирование в базу данных позже, перенастроив пакет snort-mysql командой 'dpkg-reconfigure -plow snort-mysql'
sv: Du behöver bara göra detta den första gången du installerar snort-mysql. Innan den fortsätter bör du kontrollera att du har (1) värdnamnet på maskinen som kör MySQL-servern och som tillåter TCP-anslutningar från denna värd, (2) en databas på den server, (3) ett användarnamn och lösenord för att koppla sig mot databasen. Om du inte har _alla_ av dessa, antingen svara "nej" och kör med vanlig loggning mot fil eller lös problemet. Du kan alltid konfigurera databasloggning senare genom att konfigurera om snort-mysql-paketet med kommandot "dpkg-reconfigure -plow snort-mysql".

source: Snort needs a configured database to log to before it starts.
gl: Snort precisa dunha base de datos configurada para se conectar a ela antes de se iniciar.

source: Snort needs a configured database before it can successfully start up. In order to create the structure you need to run the following commands AFTER the package is installed: cd /usr/share/doc/snort-mysql/ zcat create_mysql.gz | mysql -u <user> -h <host> -p <databasename> Fill in the correct values for the user, host, and database names. MySQL will prompt you for the password.
de: Snort benötigt eine eingerichtete Datenbank, bevor Sie es nutzen können. Um diese aufzubauen, müssen Sie folgende Kommandos NACH der Installation ausführen: cd /usr/share/doc/snort-mysql/ zcat create_mysql.gz | mysql -u <Benutzer> -h <Rechner> -p <DB-Name> Geben Sie die korrekten Werte für Benutzer, Rechner und Datenbankname ein. MySQL wird Sie nach dem Passwort fragen.
gl: Snort precisa dunha base de datos configurada antes de se poder iniciar con éxito. Para crear a estructura ten que executar as seguintes ordes DESPOIS de instalar o paquete: cd /usr/share/doc/snort-mysql/ zcat create_mysql.gz | mysql -u <usuario> -h <servidor> -p <nomebasedatos> Encha os valores corectos para o usuario, servidor e nome da base de datos. MySQL halle pedir o contrasinal.
ru: Snort нужна настроенная база данных, прежде чем он сможет успешно запуститься. Чтобы создать структуру, вы должны запустить следующую команду ПОСЛЕ установки пакета: cd /usr/share/doc/snort-mysql/ zcat create_mysql.gz | mysql -u <пользователь> -h <машина> -p <база> Замените на правильные значения пользователя, машины и базы данных. MySQL запросит у вас пароль.
sv: Snort behöver en konfigurerad databas innan den kan starta korrekt. För att skapa databasstrukturen behöver du köra följande kommandon EFTER att paketet har installerats: cd /usr/share/doc/snort-mysql/ zcat create_mysql.gz | mysql -u <användare> -h <värd> -p <databasnamn> Fyll i de korrekta värdena för användaren, värd och databasens namn. MySQL kommer att fråga dig efter lösenordet.

source: After you created the database structure, you will need to start Snort manually.
de: Wenn Sie die Datenbankstruktur angelegt haben, müssen Sie Snort noch starten.
gl: Despois de crear a estructura da base de datos ha ter que iniciar Snort manualmente.
ru: Вам надо запустить Snort вручную после создания структуры базы данных.
sv: Efter att du skapat databasstrukturen behöver du starta Snort manuellt.

source: Please enter the hostname of the mysql database server to use.
es: Introduzca el nombre de servidor de la base de datos mysql que va a utilizar.
gl: Introduza o nome do servidor da base de datos mysql a empregar.
ja: mysql サーバのホスト名を入力してください。

source: Make sure it has been set up correctly to allow incoming connections from this host!
de: Stellen Sie sicher, dass er so eingerichtet ist, dass er Verbindungen von diesem Rechner annimmt!
es: ¡Asegúrese de que se ha configurado correctamente para permitir conexiones entrantes desde este servidor!
gl: Asegúrese de que estea configurado correctamente para aceptar conexións entrantes desta máquina.
ja: このホストからの接続要求が許可されるように、設定を正しく行ってください!
ru: Убедитесь, что он правильно настроен на прием входящих соединений от этого компьютера!
sv: Kontrollera att den har konfigurerats korrekt och att den tillåter inkommande uppkopplingar från denna värd!

source: Please enter the name of the database to use.
es: Por favor, indique el nombre de la base de datos a utilizar.
gl: Introduza o nome da base de datos a empregar.
ja: 使用するデータベース名を入力してください。

source: Make sure this database has been created and your database user has write access to this database.
de: Stellen Sie sicher, dass die Datenbank angelegt wurde und Ihr Benutzer Schreibzugriff auf die Datenbank hat.
es: Asegúrese de que la base de datos ha sido creada y de que su usuario tiene acceso de escritura a esta base de datos.
gl: Asegúrese de que a base de datos estea creada e o usuario da base de datos teña acceso de escritura á base de datos.
ja: このデータベースが既に作られており、データベースユーザに書き込み権限があるのを確認してください。
ru: Убедитесь, что база данных была создана и ваш пользователь базы данных имеет доступ на запись в базу.
sv: Kontrollera att denna databas har skapats och att din databasanvändare har skrivrättigheter till denna databas.

source: Please enter the name of the database user you want to use.
es: Por favor, introduzca el nombre de usuario de la base de datos que quiere utilizar.
gl: Introduza o nome do usuario da base de datos a empregar.
ja: 使用するデータベースのユーザ名を入力してください。

source: Make sure this user has been created and has write access.
de: Stellen Sie sicher, dass der Benutzer angelegt wurde und Schreibzugriff auf die Datenbank hat.
es: Asegúrese de que el usuario ha sido creado y tiene permisos de escritura.
gl: Asegúrese de que este usuario estea creado e teña acceso de escritura.
ja: ユーザが既に作られており、書き込み権限をもっていることを確認してください。
ru: Убедитесь, что пользователь создан и у него есть доступ на запись.
sv: Kontrollera att denna användaren har skapats och har skrivrättigheter.

source: Please enter the password for the database connection.
es: Por favor, introduzca la contraseña para la conexión con la base de datos.
gl: Introduza o contrasinal para a conexión á base de datos.
ja: データベース接続に使用するパスワードを入力してください。

source: Please enter a password to connect to the Snort Alert database.
de: Bitte das Passwort für die Verbindung zur Alarm-Datenbank von Snort eingeben.
es: Por favor, introduzca la contraseña para conectarse a la base de datos de alertas de Snort.
gl: Introduza un contrasinal para se conectar á base de datos de alertas de Snort.
ja: Snort アラートデータベース に接続する際に使用するパスワードを入力してください。
ru: Введите пароль для подключения к базе данных Snort Alert.
sv: Ange ett lösenord för uppkoppling mot Snorts larmdatabas.

source: Do you want to set up a database for snort-pgsql to log to?
de: Wollen Sie für snort-pgsql eine Datenbank einrichten, in die es protokolliert?
es: ¿Quiere preparar una base de datos para que la utilice snort-pgsql?
gl: ¿Quere configurar unha base de datos para os rexistros de snort-pgsql?
ja: snort-pqsql を利用してログに記録するため、データベースを設定しますか?
ru: Установить базу данных для журналирования с помощью snort-pgsql?
sv: Vill du konfigurera en databas för snort-pgsql att logga in på?

source: You only need to do this the first time you install snort-pgsql. Before you go on, make sure you have (1) the hostname of a machine running a pgsql server set up to allow tcp connections from this host, (2) a database on that server, (3) a username and password to access the database. If you don't have _all_ of these, either select 'no' and run with regular file logging support, or fix this first. You can always configure database logging later, by reconfiguring the snort-pgsql package with 'dpkg-reconfigure -plow snort-pgsql'
de: Das ist nur bei der ersten Installation von snort-pgsql nötig. Bevor Sie weiter machen, stellen Sie sicher, dass Sie (1) den Namen des Rechners kennen, auf dem ein PostgreSQL-Server läuft und der TCP-Verbindungen von Ihrem Rechner annimmt, dass (2) es eine Datenbank auf diesem Server gibt und dass (3) Sie einen Datenbank-Benutzernamen mit Passwort kennen. Wenn Sie nicht _alle_ dieser Angaben haben, besorgen Sie sich diese zuerst oder lehnen hier ab und arbeiten mit Protokollierung in eine normale Datei. Sie können das Protokollieren in eine Datenbank später einschalten, indem Sie das Paket snort-pgsql mit dem Kommando 'dpkg-reconfigure -plow snort-pgsql' neu einrichten.
es: Sólo tiene que hacer ésto la primera vez que instale snort-pgsql. Andes de seguir adelante asegúrese de que (1) el nombre de servidor del equipo que ejecuta la base de datos mysql permite realizar conexiones tcp desde éste equipo, (2) hay una base de datos en ese servidor, (3) el nombre de usuario y contraseña de acceso a la base de datos. Si no tiene _todos_ estos, escoja «no» y continúe con la configuración habitual de registro, o arregle esto. Siempre puede configurar la base de datos más adelante reconfigurando snort-pgsql utilizando: «dpkg-reconfigure -plow snort-pgsql»
gl: Só ten que o facer a primeira vez que instale snort-pgsql. Antes de continuar, asegúrese de ter (1) o nome dunha máquina que execute un servidor pgsql configurado para aceptar conexións tcp desta máquina, (2) unha base de datos nese servidor, (3) un nome de usuario e contrasinal para acceder á base de datos. Se non ten _todo_ iso, escolla "non" e execute Snort co soporte normal de rexistro en ficheiros ou arranxe a situación antes de nada. Sempre pode configurar despois o rexistro en bases de datos, reconfigurando o paquete snort-pgsql con "dpkg-reconfigure -plow snort-pgsql".
ja: 初めて snort-pgsql をインストールした時のみ、この設定を行う必要があります。続行の前に、(1) このホストからの TCP 接続が許可されている pgsql サーバのホスト名、(2) そのサーバでのデータベース名、(3) データベースにアクセスするためのユーザ名とパスワード を確認してください。これらが「すべて」そろっていない場合、 'no' を選択して通常のログ記録を行うか、まず条件を確認してください。のちほど 'dpkg-reconfigure -plow snort-pgsql' と実行し snort-mysql パッケージを再設定して、データベースでのログ記録設定の変更がいつでも可能です。
ru: Вы должны сделать это при первой установке snort-pgsql. Прежде чем продолжить, убедитесь, что у вас есть (1) имя машины с работающим сервером pgsql, настроенным на прием tcp соединений с этого компьютера, (2) база данных на этом сервере, (3) имя пользователя и пароль для доступа к базе. Если у вас нет _всего_ этого, то либо выберите 'no' и работайте с поддержкой журналов в обычном файле, либо исправьте ситуацию. Вы всегда можете настроить журналирование в базу данных позже, перенастроив пакет snort-pgsql командой 'dpkg-reconfigure -plow snort-pgsql'
sv: Du behöver bara göra detta den första gången du installerar snort-pgsql. Innan den fortsätter ska du kontrollera att du har (1) värdnamnet på maskinen som kör pgsql-servern och som tillåter TCP-anslutningar från denna värd, (2) en databas på den server, (3) ett användarnamn och lösenord för att koppla sig mot databasen. Om du inte har _alla_ av dessa, antingen svara "nej" och kör med vanlig loggning mot fil eller lös problemet. Du kan alltid konfigurera databasloggning senare genom att konfigurera om snort-pgsql-paketet med kommandot "dpkg-reconfigure -plow snort-pgsql".

source: Snort needs a configured database before it can successfully start up. In order to create the structure you need to run the following commands AFTER the package is installed: cd /usr/share/doc/snort-pgsql/ zcat create_postgresql.gz | psql -U <user> -h <host> -W <databasename> Fill in the correct values for the user, host, and database names. PostgreSQL will prompt you for the password.
de: Snort benötigt eine eingerichtete Datenbank, bevor Sie es nutzen können. Um diese aufzubauen, müssen Sie folgende Kommandos NACH der Installation ausführen: cd /usr/share/doc/snort-pgsql/ zcat create_postgresql.gz | psql -U <Benutzer> -h <Rechner> -W <DB-Name> Geben Sie die korrekten Werte für Benutzer, Rechner und Datenbankname ein. PostgreSQL wird Sie nach dem Passwort fragen.
gl: Snort precisa dunha base de datos configurada antes de se poder iniciar con éxito. Para crear a estructura ten que executar as seguintes ordes DESPOIS de instalar o paquete: cd /usr/share/doc/snort-pgsql/ zcat create_postgresql.gz | psql -u <usuario> -h <servidor> -p <nomebasedatos> Encha os valores corectos para o usuario, servidor e nome da base de datos. PostgreSQL halle pedir o contrasinal.
ru: Snort нужна настроенная база данных, прежде чем он сможет успешно запуститься. Чтобы создать структуру, вы должны запустить следующую команду ПОСЛЕ установки пакета: cd /usr/share/doc/snort-pgsql/ zcat create_postgresql.gz | psql -U <пользователь> -h <машина> -W <базаданных> Замените на правильные значения пользователя, машины и базы данных. PostgreSQL запросит у вас пароль.
sv: Snort behöver en konfigurerad databas innan den kan starta korrekt. För att skapa databasstrukturen behöver du köra följande kommandon EFTER att paketet har installerats: cd /usr/share/doc/snort-pgsql/ zcat create_postgresql.gz | psql -U <användare> -h <värd> -W <databasnamn> Fyll i de korrekta värdena för användaren, värd och databasens namn. PostgresSQL kommer att fråga dig efter lösenordet.

source: Please enter the hostname of the pgsql database server to use.
es: Introduzca el nombre de servidor de la base de datos psql que va a utilizar.
gl: Introduza o nome do servidor da base de datos pgsql a empregar.
ja: PostgreSQL サーバのホスト名を入力してください。

source: Your configuration file is deprecated
de: Ihre Konfigurationsdatei ist veraltet.
es: Su fichero de configuración es obsoleto
gl: O seu ficheiro de configuración está obsoleto
ja: 無効な設定ファイルです
ru: Ваш файл настроек устарел
sv: Din konfigurationsfil är inte möjlig att använda
