Repository: nbargnesi/debian-snort
Catalog: debian/po/*.po
Languages: de, es, gl, it, ja, nl, ro, ru, sv

source: After you have created the database structure, you will need to start Snort manually.
it: Dopo aver creato la struttura del database, è necessario avviare Snort manualmente.
nl: Nadat u de databank struktuur heeft aangemaakt, moet u Snort manueel starten.
ro: După ce ați creat structura bazei de date, va trebui să porniți manual Snort-ul.

source: Set up a database for snort-pgsql to log to?
it: Configurare un database per i log di snort-pgsql?
nl: Wilt u een database opzetten waar snort-pgsql het logboek in kan bijhouden?
ro: Se pregătește o bază de date în care snort-pgsql va face jurnalizarea?

source: Database logging can be reconfigured later by running 'dpkg-reconfigure -plow snort-pgsql'.
it: Il database dei log può essere riconfigurato successivamente lanciando 'dpkg-reconfigure -plow snort-pgsql'.
nl: Logging naar een databank kan later geherconfigureerd worden met het commando'dpkg-reconfigure -plow snort-pgslq'
ro: Jurnalizarea într-o bază de date poate fi reconfigurată mai târziu, cu comanda „dpkg-reconfigure -plow snort-pgsql”.

source: cd /usr/share/doc/snort-pgsql/ zcat create_postgresql.gz | psql -U <user> -h <host> -W <databasename>
ro: cd /usr/share/doc/snort-pgsql/ zcat create_postgresql.gz | psql -U <utilizator> -h <numeserver> -W <numelebazeidedate>

source: Fill in the correct values for the user, host, and database names. PostgreSQL will prompt you for the password.
it: Riempire i valori corretti dei nomi utente, host e database. PostgreSQL richiederà la password.
nl: Vul de correcte waarden in voor gebruiker, host en databank namen.PostgreSQL zal u later vragen om het paswoord.
ro: Introduceți valorile corecte pentru utilizator, numele serverului și numele bazei de date. PostgreSQL vă va cere interactiv parola.

source: Deprecated configuration file
it: File di configurazione deprecato
nl: Verouderd configuratie bestand
ro: Fișier de configurare depășit

source: The Snort configuration file (/etc/snort/snort.conf) uses deprecated options no longer available for this Snort release. Snort will not be able to start unless you provide a correct configuration file. Either allow the configuration file to be replaced with the one provided in this package or fix it manually by removing deprecated options.
it: Il file di configurazione di Snort (/etc/snort/snort.conf) utilizza opzioni deprecate non più disponibili per questa versione di Snort. Snort non potrà partire finché non si fornisce un file di configurazione corretto. Si può sostituire il file di configurazione con quello incluso in questo pacchetto oppure correggerlo manualmente rimuovendo le opzioni deprecate.
nl: Uw snort-configuratiebestand (/etc/snort/snort.conf) maakt gebruik van verouderde opties die door deze versie niet meer ondersteund worden. Met een onjuist configuratiebestand kan Snort niet opstarten. U kunt uw bestaande configuratiebestand vervangen met het door dit pakket meegeleverde bestand, of u kunt de verouderde opties handmatig verwijderen.
ro: Fișierul de configurare pentru Snort (/etc/snort/snort.conf) folosește opțiuni depășite care nu mai sunt disponibile în această versiune de Snort. Snort nu va putea porni decât dacă furnizați un fișier de configurare corect. Fie permiteți înlocuirea fișierului de configurare cu cel furnizat de pachet sau să îl reparați manual prin ștergerea opțiunilor depășite.

source: The following deprecated options were found in the configuration file: ${DEP_CONFIG}
it: Le seguenti opzioni deprecate sono state trovate nel file di configurazione: ${DEP_CONFIG}
ro: În fișierul de configurare au fost găsite următoarele opținuni învechite: ${DEP_CONFIG}.

source: boot, dialup, manual
de: Systemstart, Einwahl, Manuell
es: arranque, conexión, manual
gl: inicio, conexión, manual
ja: 起動時, ダイヤルアップ時, 手動
ru: загрузка, дозвон, вручную
sv: uppstart, uppkoppling, manuellt

source: When should Snort be started?
de: Wann soll Snort gestartet werden?
es: ¿Cuando debería arrancarse Snort?
gl: ¿Cando se debe iniciar Snort?
ja: いつ Snort を起動しますか?
ru: Когда надо запускать Snort?
sv: När ska Snort startas?

source: Snort can be started during boot, when connecting to the net with pppd or only when you manually start it via /usr/sbin/snort.
de: Snort kann beim Systemstart, bei der Einwahl ins Internet mit Pppd oder nur manuell mittels /usr/sbin/snort gestartet werden.
es: Snort se puede arrancar snort en el arranque del sistema, cuando el sistema se conecte a Internet con pppd o sólo cuando lo arranque manualmente ejecutandolo con «/usr/sbin/snort».
gl: Snort pode arrincarse no inicio do sistema, ao se conectar á rede mediante pppd ou só ao inicialo manualmente mediante /usr/sbin/snort.
ja: Snort は、システム起動中、pppd を利用してネットワークに接続した時、または "/usr/sbin/snort" と手動で実行した時のみ、のいずれかで起動できます。
ru: Snort может запускаться при загрузке, при подключении к сети через pppd или только когда вы вручную запустите его с помощью /usr/sbin/snort.
sv: Snort kan startas vid uppstart, när uppkoppling mot nätverk sker (pppd) eller bara när du manuellt startat den med /usr/sbin/snort.

source: On which interface(s) should Snort listen?
es: ¿En qué interfaz(ces) debería escuchar Snort?
gl: ¿En que interfaces debe escoitar Snort?

source: Please enter the name(s) of the interface(s) which Snort should listen on. The names of the available interfaces are provided by either running 'ip link show' of 'ifconfig'. This value usually is 'eth0', but you might want to vary this depending on your environment, if you are using a dialup connection 'ppp0' might be more appropiate.
gl: Introduza os nomes das interfaces nas que debería escoitar Snort. Os nomes das interfaces dispoñibles pódense consultar executando "ip link show" ou "ifconfig". Este valor adoita ser "eth0", pero pode cambialo dependendo do seu ambiente. Se emprega unha conexión por módem, "ppp0" pode ser máis axeitado.

source: Notice that Snort is usually configured to inspect all traffic coming from the Internet, so the interface you add here is usually the same the 'default route' is on. You can determine which interface is used for this running either '/sbin/ip ro sh' or '/sbin/route -n' (look for 'default' or '0.0.0.0').
es: Tenga en cuenta que generalmente se configura a Snort para que analice todo el tráfico que viene de Internet, así que la interfaz que se añade aquí es generalmente la misma que tiene definida la ruta por omisión. Para determinar qué interfaz se está utilizando para esto, ejecute bien «/sbin/ip ro sh» o bien «/sbin/route -n» (busque aquellos valores asociados a «default» o «0.0.0.0»).
gl: Teña en conta que Snort adoita estar configurado para inspeccionar todo o tráfico que procede de Internet, así que a interface que engada aquí adoita ser a mesma da "ruta por defecto". Pode determinar a interface que se emprega executando "/sbin/ip ro sh" ou "/sbin/route -n" (busque "default" ou "0.0.0.0").
ja: 通常、Snort はインターネットからやって来るすべてのトラフィックを受け取るように設定されるので、ここで追加したインターフェイスは大抵 'default route' が存在するものと同じであるのに注意してください。'/sbin/ip ro sh' または '/sbin/route -n' を実行し ('default' または '0.0.0.0' を探して)、どのインターフェイスを使うかを決められます。

source: It is also not uncommon to run Snort on an interface with no IP and configured in promiscuous mode, if this is your case, select the interface in this system that is physically connected to the network you want to inspect, enable promiscuous mode later on and make sure that the network traffic is sent to this interface (either connected to a 'port mirroring/spanning' port in a switch, to a hub or to a tap)
es: Tampoco es infrecuente ejecutar Snort en una interfaz sin dirección IP que esté configurada en modo promiscuo. Si este es su caso, seleccione el interfaz en el sistema que está físicamente conectado a la red que quiere inspeccionar, active el modo promíscuo más adelante y asegúrese que el tráfico de dicha red se está enviado a esa interfaz (bien conectándola a un puerto del switch en modo «port mirroring/spanning», bien conectado a un hub o a un tup)
gl: Tampouco é pouco habitual executar Snort nunha interface sen IP e configurada en modo promiscuo. Se este é o seu caso, escolla a interface deste sistema que estea conectada fisicamente á rede que quere inspeccionar, active despois o modo propiscuo e asegúrese de que o tráfico da rede se envíe a esta interface (conectada a un porto "espello/árbore" dun switch, a un concentrador de rede ou a unha toma).
ja: IP を付与していないインターフェイス上で promiscuous モードの Snort を動作させるのはあまり一般的ではありません。これに当てはまるような場合、受信を行いたいネットワークに対して物理的に接続されているこのシステム上のインターフェイスを選択し、後ほど promiscuous モードを有効にしてネットワークトラフィックがこのインターフェイス (スイッチの 'port mirrorin' ポート・'spanning' ポートかリピーターハブ、あるいはネットワークタップに接続されています) に流れているのを確認してください。

source: You can configure multiple interfaces here, just by adding more than one interface name separated by spaces. Each interface can have its specific configuration.
de: Sie mehrere Schnittstellennamen durch Leerzeichen getrennt eingeben. Jede Schnittstelle kann ihre eigenen Einstellungen haben.
es: Puede configurar múltiples interfaces simplemente añadiendo más de un nombre y separándolo por espacios. Cada interfaz tiene su propia configuración.
gl: Pode configurar aquí varias interfaces engadindo varios nomes de interfaces separados mediante espazos. Cada interface pode ter a súa configuración específica.
ru: Вы можете указать здесь несколько интерфейсов, просто добавив более одного имени интерфейса через пробел. У каждого интерфейса могут быть свои собственные настройки.
sv: Du kan konfigurera flera gränssnitt här, bara att lägga till fler än ett gränssnittsnamn separerade med blanksteg. Varje gränssnitt kan ha sin egen specifika konfiguration.

source: Please enter the address range that Snort will listen on.
es: Introduzca el intervalo de direcciones que monitorizará Snort.
gl: Escolla o rango de enderezos nos que ha escoitar Snort.
ja: Snort が listen するアドレスの範囲を入力してください。

source: You have to use CIDR form, i.e. 192.168.1.0/24 for a block of 256 IPs or 192.168.1.42/32 for just one. Specify multiple addresses on a single line separated by ',' (comma characters), no spaces allowed!
de: Sie müssen das CIDR-Format benutzen, z. B. 192.168.1.0/24 für einen Block von 256 IP-Adressen oder 192.168.1.42/32 für nur eine. Trennen Sie mehrere IP-Adressen in einer Zeile durch Komma, Leerzeichen sind nicht erlaubt!
es: Tiene que utilizar el formato CIDR, esto es, 192.168.1.0/24 para un bloque de 256 IPs o 192.168.1.42/32 para sólo una dirección. Indique múltiples direcciones en una sola línea separados por «,» (comas). No se permiten espacios en blanco.
gl: Ten que empregar a forma CIDR; é dicir, 192.168.1.0/24 para un bloque de 256 IPs ou 192.168.1.42/32 para só unha IP. Indique varios enderezos nunha soa liña separados por "," (comas); non se admiten espazos.
ja: CIDR 形式での記述が必要です。例えば 192.168.1.0/24 は 256 個の IP ブロックで、192.168.1.42/32 は IP 1 個となります。複数のアドレスは 1 行で ',' (カンマ) で区切って記述します。スペース (空白) は使えません!
ru: Можете использовать формат CIDR, т.е. 192.168.1.0/24 для блока из 256 IP или 192.168.1.42/32 для одного. Несколько адресов указываются на одной строке через ',' (символ запятой), пробелы запрещены!
sv: Du ska använda CIDR-formatet, till exempel 192.168.1.0/24 för ett block av 256 IP-adresser eller 192.168.1.42/32 för bara en av dem. Ange flera adresser på samma rad separerade med "," (kommatecken), blanksteg är inte tillåtna!

source: If you want you can specify 'any', to not trust any side of the network.
de: Sie können »any« eingeben, um keiner Seite des Netzwerkes zu vertrauen.
es: Si quiere, puede especificar «any» (cualquiera) si no confía en ningún lado de su red.
gl: Se quere pode especificar "any", para non confiar en ningún lado da rede.
ja: ローカルネットワーク・公開ネットワークのどちらのネットワークも信頼していない場合、 'any' と指定してください。
ru: Можно указать 'any', чтобы не доверять любой стороне сети.
sv: Om du vill kan du ange "any" för att inte lita på någon sida av nätverket.

source: Notice that if you are using multiple interfaces this definition will be used as the HOME_NET definition of all of them.
de: Beachten Sie, wenn Sie mehrere Schnittstellen benutzen, wird diese Festlegung als HOME_NET-Definition für alle verwendet.
es: Tenga en cuenta que si está utilizando múltiples interfaces se utilizará esta definición como valor de «HOME_NET» para todos ellos.
gl: Teña en conta que se emprega varias interfaces esta definición hase empregar coma a definición HOME_NET de todas elas.
ru: Обратите внимание, если вы используете несколько интерфейсов, то это определение будет использовано как определение HOME_NET для всех интерфейсов.
sv: Observera att om du använder flera gränssnitt kommer denna definition att användas som HOME_NET-definition på alla.

source: Disabling promiscuous mode means that Snort will only see packets addressed to it's own interface. Enabling it allows Snort to check every packet that passes ethernet segment even if it's a connection between two other computers.
de: Das Ausschalten des Modus' »promiscuous« bedeutet, dass Snort nur die Pakete sehen wird, die an seine eigene Schnittstelle adressiert sind. Das Einschalten ermöglicht es Snort, alle Pakete, die ein Netzwerk-Segment durchlaufen, zu überprüfen, auch wenn es eine Verbindung zwischen zwei anderen Rechnern ist.
es: Al deshabilitar el modo promíscuo snort sólo estará a la escucha de paquetes dirigidos a su propia interfaz. Si lo activa le permitirá comprobar cada paquete que pase el medio ethernet incluso aunque sea una conexión entre otros dos sistemas.
gl: Desactivar o modo promiscui significa que Snort só ha ver os paquetes dirixidos á súa propia interface. Activalo permite a Snort comprobar cada paquete que pase polo segmento Ethernet, incluso se é unha conexión entre outros dous ordenadores.
ja: promiscuous モードを無効にすることによって Snort は自身の持つインターフェイスへ向けられたパケットのみを監視します。有効にすると、他のコンピュータ間のやり取りを含めたイーサネットセグメント上の全てのパケットをチェックするようになります。
ru: Запрет режима прослушивания означает, что Snort будет видеть только те пакеты, которые адресованы его интерфейсу. Разрешение позволяет Snort проверить каждый пакет, проходящий через сегмент ethernet, даже если это соединение между двумя другими компьютерами.
sv: Inaktivering av promiscuousläget betyder att Snort bara kommer att se paket adresserade till sitt eget gränssnitt. Aktivering av det tillåter Snort att undersöka varje paket som passerar Ethernet-segmentet även om det är anslutning mellan två andra datorer.

source: Disable promiscuous mode if you are configuring Snort on an interface without a configured IP address.
es: Debería deshabilitar el modo promíscuo si está configurando Snort en una interfaz sin direcciones IP.
gl: Desactive o modo promiscuo se configura Snort nunha interface sen un enderezo IP configurado.
ja: IP アドレスの設定がされていないインターフェイス上で Snort を設定する場合は promiscuous モードを無効にしてください。

source: One of the interfaces you specified is not valid (it might not exist on the system or be down). Please introduce a valid interface when answering the question of which interface(s) should Snort listen on.
de: Eine der Schnittstellen, die Sie angegeben haben, ist ungültig (es gibt sie nicht in dem System oder sie ist heruntergefahren). Bitte geben Sie auf die Frage nach der Schnittstelle bzw. den Schnittstellen, an der bzw. denen Snort lauschen soll, nur gültige Schnittstellen ein.
gl: Unha das interfaces que especificou non é válida (pode non existir no sistema ou estar desactivada). Introduza unha interface válida ao respostar á pregunta sobre as interfaces nas que ten que escoitar Snort.
ru: Один из указанных вами интерфейсов неправильный (скорее всего, он не существует в системе или отключен). Введите правильный интерфейс при ответе на вопрос о том, какие интерфейсы должен слушать Snort.
sv: Ett av gränssnitten du angav är inte giltigt (det kanske inte finns på systemet eller är inaktivt). Ange ett giltigt gränssnitt när du svarar på frågan om vilket/vilka gränssnitt som Snort ska lyssna på.

source: If you did not configure an interface then the package is trying to use the default ('eth0') which does not seem to be valid in your system.
de: Wenn Sie keine Schnittstelle eingeben, verwendet das Paket die Standardschnittstelle (eth0). Das scheint bei Ihrem System nicht richtig zu sein.
gl: Se non configurou unha interface, o paquete tenta empregar a interface por defecto ("eth0"), que non semella válida no seu sistema.
ru: Если вы не укажете интерфейс, то пакет попытается использовать значение по умолчанию ('eth0'), которое скорее всего будет неправильным в вашей системе.
sv: Om du inte konfigurerade något gränssnit kommer paketet att försöka använda standardgränssnittet ("eth0") vilket inte verkar vara giltigt för ditt system.

source: Should Snort's rules testing order be changed to Pass|Alert|Log?
de: Soll Snorts Reihenfolge der Testregeln auf Pass|Alert|Log geändert werden?
es: ¿Deberían cambiarse de orden las reglas de Pasar|Alertar|Registrar?
gl: ¿Débese cambiar a orde de comprobación de regras de Snort a Pass|Alert|Log?
ja: Snort のルールセットのテスト順を Pass|Alert|Log に変更しますか?
ru: Изменить порядок проверки правил Snort на Pass|Alert|Log?
sv: Ska testordningen för reglerna i Snort ändras til Pass|Alert|Log?

source: If you change Snort's rules testing order to Pass|Alert|Log, they will be applied in Pass->Alert->Log order, instead of standard Alert->Pass->Log. This will prevent people from having to make huge Berky Packet Filter command line arguments to filter their alert rules.
de: Wenn Sie Snorts Reihenfolge der Testregeln auf Pass|Alert|Log ändern, werden sie in der Reihenfolge Pass->Alert->Log angewendet, anstelle des Standards Alert->Pass->Log. Das bewahrt die Leute davor, eine große Menge an Kommandozeilen-Argumenten des Berky-Paket-Filters angeben zu müssen, um ihre Alarmregeln zu filtern.
es: Si cambia el orden de prueba de las reglas de snort a Pasar|Alertar|Registrar, se aplicar?n el orden Pasar->Alertar->Registrar en lugar del modo estándar Alertar->Pasar->Registrar. Esto evita que se tengan que incluir muchos argumentos de línea de comandos con filtrado de paquetes para filtrar sus propias reglas de alertas.
gl: Se cambia a orde de comprobación de regras de Snort a Pass|Alert|Log, hanse aplicar na orde Aceptar->Avisar->Rexistrar, no canto da orde estándar Avisar->Aceptar->Rexistrar. Isto ha evitar que a xente teña que crear argumentos de liña de ordes xigantes para filtrar as súas regras de aviso.
ja: Snort のルールセットのテスト順を Pass|Alert|Log に変更した場合、ルールセットは 通常の Alert->Pass->Log ではなく Pass->Alert->Log の順番で適用されます。こうすることで alert ルールのフィルタするために長大な Berky Packet Filter コマンドラインを指定しなくともよくなります。
ru: Если вы измените порядок проверки правил Snort на Pass|Alert|Log, то они будут применены в порядке Pass->Alert->Log, вместо стандартного Alert->Pass->Log. Это избавит людей от создания огромных аргументов командной строки Пакетного Фильтра Berky для фильтрации их правил тревоги.
sv: Om du ändrar testordningen på Snorts regler till Pass|Alert|Log, kommer de att tillämpas i ordningen Pass->Alert->Log istället för standardordningen Alert->Pass->Log. Detta förhindrar folk från att skapa stora Berky Packet Filter kommandolinje-argument för att filtrera deras larmregler.

source: This Snort installation provides a cron job that runs daily and summarises the information of Snort logs to a selected email address. If you want to disable this feature say 'no' here.
de: Diese Snort-Installation stellt einen Cronjob zur Verfügung, der täglich ausgeführt wird und zusammengefasste Informationen aus den Protokolldateien von Snort an eine eingestellte E-Mail-Adresse schickt. Wenn Sie das nicht wollen, lehnen Sie das hier ab.
gl: Esta instalación de Snort fornece unha tarefa de cron que se executa cada día e envía un resume da información dos rexistros de Snort a un enderezo de email seleccionado. Se quere desactivar esta característica conteste "non" aquí.
ru: Эта установка Snort поставляется с заданием cron, которое запускается ежедневно и отправляет краткий отчет на базе информации из журналов Snort на выбранный адрес электронной почты. Скажите здесь 'no' для отключения такого поведения.
sv: Den här Snort-installationen tillhandahåller ett cronjobb som körs dagligen och gör ett sammandrag för informationeni Snort-loggarna och skickar till vald e-postadress. Om du vill inaktivera den här funktionen ska du svara "nej" här.

source: Who should receive the daily statistics mails?
es: ¿Quién debería recibir las estadísticas diarias?
gl: ¿Quen debe recibir os emails diarios de estatísticas?
ja: 誰が日次統計のメールを受け取りますか?

source: A cron job running daily will summarise the information of the logs generated by Snort using a script called 'snort-stat'. Introduce here the recipient of these mails. The default value is the system administrator. If you keep this value, make sure that the mail of the administrator is redirected to a user that actually reads those mails.
de: Ein Cronjob, der täglich läuft, fasst die Informationen aus den Protokolldateien, die Snort erzeugt, durch das Skript »snort-stat« zusammen. Geben Sie hier den Empfänger dieser E-Mails ein. Standardmäßig ist das der Systemadministrator. Wenn Sie das so lassen, sorgen Sie dafür, dass die E-Mails an den Administrator an einen Benutzer weitergeleitet werden, der momentan solche E-Mails liest.
es: Se ejecuta diariamente una tarea del «cron» para resumir la información de los registros generados por Snort utilizando un programa llamado «snort-stat». Indique aquí el receptor de dichos mensajes. El valor por defecto es el administrator del sistema. Si mantiene este valor asegúrese de que los correos de dicha cuenta son reenviados o leídos por algún usuario.
gl: Unha tarefa de cron que se executa diariamente ha resumir a información dos rexistros xerados por Snort empregando un script chamado "snort-stat". Introduza aquí o destinatario deses emails. O valor por defecto é o administrador do sistema. Se conserva este valor, asegúrese de que o email do administrador se redirixa a un usuario que realmente lea esas mensaxes.
ja: 毎日実行される cronjob は 'snort-stat' と呼ばれるスクリプトを使い、Snort によって生成されるログの情報を要約します。ここで、これらのメールを受け取り人を指定してください。標準の値はシステム管理者です。この値のままにしておきたい場合は、管理者のメールがこれらのメールを読むユーザに実際に転送されているのを確認してください。
ru: Задание cron запускается ежедневно и создает краткий отчет на базе информации из журналов Snort с помощью сценария 'snort-stat'. Укажите здесь получателя таких писем. По умолчанию это системный администратор. Если оставите значение по умолчанию, убедитесь, что почта администратора пересылается пользователю, действительно читающему почту.
sv: Ett cronjob körs dagligen skapar en rapport av information i loggarna som Snort genererar genom ett att köra ett skript som heter "snort-stat". Ange vem som ska ta emot dessa rapporter (via e-post). Standardvärdet här är systemadministratören. Om du behåller detta värde, kontrollera att e-posten till administratören är omdirigerad till en användare som har möjlighet att läsa e-posten.

source: If you want to specify custom options to Snort, please specify them here.
es: Si quiere aadir opciones adicionales a Snort, especifiquelas aquí:
gl: Se quere especificar opcións personalizadas para Snort, indíqueas aquí.
ja: Snort にオプションを指定したい場合、ここで入力してください。

source: An alert needs to appear more times than this number to be included in the daily statistics.
es: Una alerta debe aparecer más de éste número de veces para aparecer en las estadísticas.
gl: Unha alerta ten que aparecer máis veces que este número para se incluír nas estatísticas diarias.
ja: 日時統計へ反映される為には、この回数よりもアラートが多く現れる必要があります。

source: You are running Snort manually.
es: Está ejecutando Snort manualmente.
gl: Está a executar Snort manualmente.
ja: 手動で Snort を動作させています。
